-- 创建部门表
create table dept(
                     id int unsigned primary key auto_increment comment '主键ID',
                     name varchar(10) not null unique comment '部门名称',
                     create_time datetime comment '创建时间',
                     update_time datetime comment '修改时间'
) comment '部门表';

insert into dept values (1, '学工部', '2023-09-25 09:47:35', '2023-11-01 09:47:35'),
                        (2, '教研部', '2023-09-26 09:47:35', '2023-10-03 09:47:35'),
                        (3, '就业部', '2023-09-27 09:47:35', '2023-10-12 09:47:35'),
                        (4, '人事部', '2023-09-28 09:47:35', '2023-12-11 09:47:35'),
                        (5, '行政部', '2023-09-29 09:47:35', '2023-10-20 09:47:35'),
                        (6, '综合部', '2023-09-30 09:47:35', '2023-11-15 09:47:35'),
                        (7, '咨询部', '2023-09-01 09:47:35', '2023-12-05 09:47:35');